<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"13e971b2960d4b57d73d7dd9a98f9e9901d8b70bc960a3c355d5c0594f0701db","plan_job_ref":"Job Pull Request Checks #4895 at https://github.com/GSA-TTS/FAC/actions/runs/16237077780","plan_out_hash":"a15b9cf2d17c461a4c7ae60464407d6b2a38a908f43add755faa1bd68005919f","plan_hash":"8bb11e667796f36ea84ab3aa3452b0ac7000853e0cd8c62c478fdf9fe9e8eaf1","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 3 to add, 10 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (2 unchanged elements hidden)
        ]
    }

  # module.staging.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.staging.cloudfoundry_network_policy.logshipper-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "logshipper-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> (known after apply)
!~              source_app      = "69025dbf-8d9c-4b1d-ab09-06ba137d1be1" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
        ]
    }

  # module.staging.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> (known after apply)
!~              source_app      = "c07fdedc-2e37-4572-80ba-fc04d5a087ed" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "c07fdedc-2e37-4572-80ba-fc04d5a087ed" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.staging.module.cg-logshipper.cloudfoundry_app.logshipper_app will be updated in-place
!~  resource "cloudfoundry_app" "logshipper_app" {
!~      created_at                  = "2025-04-21T19:51:00Z" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "logshipper"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-staging-logshipper.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "cea07b634f9038be3326e23871256811b9bfa56cd12cd424bbf22b8695c5414f" -> "b848606c3d6dbebe719b499864e859e6b64345231d7ea7a9849953b74b94d21e"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-07-11T10:52:37Z" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # module.staging.module.cg-logshipper.cloudfoundry_route.logshipper_route will be updated in-place
!~  resource "cloudfoundry_route" "logshipper_route" {
!~      destinations = [
-           {
-               app_id           = "69025dbf-8d9c-4b1d-ab09-06ba137d1be1" -> null
-               app_process_type = "web" -> null
-               id               = "1793196f-4770-4065-9a8d-47af5789cd91" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "ea6986d2-46cd-4850-aff0-0e3c72d24e39"
!~      updated_at   = "2025-04-21T19:51:53Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-07-11T10:43:06Z" -> (known after apply)
        }
    }

  # module.staging.module.fac-file-scanner.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.staging.module.fac-file-scanner.data.external.scannerzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "scannerzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-scanner.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "../shared/modules/scanner"
    }

  # module.staging.module.fac-file-scanner.cloudfoundry_app.scanner_app will be updated in-place
!~  resource "cloudfoundry_app" "scanner_app" {
!~      created_at                  = "2025-04-21T19:51:55Z" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "fac-file-scanner"
!~      path                        = "../shared/modules/scanner/scanner.zip" -> (known after apply)
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-file-scanner-staging.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "f1cc76859fddc06a2488357991c3ee7329791a6441c45dcdfbc57fde2188a6bf" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-06-13T10:42:57Z" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.staging.module.fac-file-scanner.cloudfoundry_route.scanner_route must be replaced
-/+ resource "cloudfoundry_route" "scanner_route" {
!~      created_at   = "2025-06-17T17:13:21Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "c07fdedc-2e37-4572-80ba-fc04d5a087ed" -> null
-               app_process_type = "web" -> null
-               id               = "c5c55c48-fc6e-4198-8ba9-1cbf8b8e30d0" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      updated_at   = "2025-06-17T17:13:21Z" -> (known after apply)
!~      url          = "fac-file-scanner-staging.apps.internal" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.staging.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2025-04-21T19:50:48Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "https-proxy"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "gsa-tts-oros-fac-staging-egress-https-proxy.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "16790bf86a560f780365920494820fac86b0243b49eae0dbe0cfb0b0a57f50c9" -> "6021ee7a7976d748fb2e448072aa1c11c0602ed4c4ea2f6bdc90055a95758d6e"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-07-11T10:52:29Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.staging.module.https-proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> null
-               app_process_type = "web" -> null
-               id               = "f0bc28bf-37ff-4a8a-8a53-9a86743ea50d" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "d2e8c906-3614-474f-869d-3f0e0a12cbbe"
!~      updated_at   = "2025-04-21T19:51:00Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.fac-file-scanner.module.quarantine.data.cloudfoundry_service_plans.s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "s3" {
+       name                  = "basic"
+       service_offering_name = "s3"
+       service_plans         = (known after apply)
    }

  # module.staging.module.fac-file-scanner.module.quarantine.cloudfoundry_service_instance.bucket will be updated in-place
!~  resource "cloudfoundry_service_instance" "bucket" {
+       dashboard_url     = (known after apply)
        id                = "b4cf43f9-7ada-4c21-9d16-b340672e50ae"
!~      last_operation    = {
!~          created_at  = "2025-03-14T14:54:11Z" -> (known after apply)
+           description = (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "update" -> (known after apply)
!~          updated_at  = "2025-03-14T14:54:11Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "fac-file-scanner-quarantine"
!~      service_plan      = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806" -> (known after apply)
        tags              = [
            "s3",
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2025-03-14T14:54:11Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.staging.module.file_scanner_clamav.module.route.data.cloudfoundry_domain.domain will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "domain" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.module.route.data.cloudfoundry_org.org will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_org" "org" {
+       annotations = (known after apply)
+       created_at  = (known after apply)
+       id          = (known after apply)
+       labels      = (known after apply)
+       name        = "gsa-tts-oros-fac"
+       quota       = (known after apply)
+       suspended   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.module.route.data.cloudfoundry_space.space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "space" {
+       allow_ssh         = (known after apply)
+       annotations       = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       isolation_segment = (known after apply)
+       labels            = (known after apply)
+       name              = "staging"
+       org               = (known after apply)
+       quota             = (known after apply)
+       updated_at        = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route must be replaced
-/+ resource "cloudfoundry_route" "app_route" {
!~      created_at   = "2025-06-17T17:14:06Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "23cd75fe-c912-44e7-8999-4686eae30d72" -> null
-               app_process_type = "web" -> null
-               id               = "b74722e4-9b39-4eb3-942b-9abadc9aaa56" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = "************************************"
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      space        = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807" -> (known after apply) # forces replacement
!~      updated_at   = "2025-06-17T17:14:06Z" -> (known after apply)
!~      url          = "fac-av-staging-fs.apps.internal" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 3 to add, 10 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4895](https://github.com/GSA-TTS/FAC/actions/runs/16237077780)